# FabricParamSpanSymLeft Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamSpanSymLeft Property
ParameterTypeId Class See Also
---
"Left"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamSpanSymLeft { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamSpanSymLeft As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamSpanSymLeft {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace